// profiles.js - общий файл с данными профилей
// Автоматически сгенерировано редактором 24.02.2026, 18:33:43
const profiles = [
  {
    "name": "Николай, 26",
    "distance": "18 км от вас",
    "tags": [
      "MACAN",
      "Jah Khalib",
      "GUF",
      "MiyaGi"
    ],
    "description": "Ищу HR или Стрелец/Весы/Овен\n\nЦеню искренность, чувство юмора, умение наслаждаться простыми вещами",
    "photos": [
      "https://avatars.mds.yandex.net/i?id=54020f314bf0b160580083a7fc3062dd_l-5885384-images-thumbs&n=13"
    ]
  },
  {
    "name": "Гоша Куценка, 69",
    "distance": "1 км от вас",
    "tags": [
      "Сексоголик",
      "Трудяга"
    ],
    "description": "Люблю кино и секс",
    "photos": [
      "https://is1-ssl.mzstatic.com/image/thumb/Features114/v4/e6/68/c4/e668c4b4-1141-1efd-aa7c-84ab5e5dcd32/pr_source.png/1200x675.jpg",
      "https://lisa.ru/images/cache/2021/11/22/fit_414_530_false_crop_1027_577_0_37_q90_1345142_b5317d29d04d3342ffbd42770.png"
    ]
  },
  {
    "name": " Серёга, 19",
    "distance": "10 км от вас",
    "tags": [
      "Работа",
      "Православие",
      "Лев",
      "190 см",
      "Дружба"
    ],
    "description": "",
    "photos": [
      "https://i.pinimg.com/736x/b0/9d/40/b09d408e5153007370469031ef9126fe.jpg",
      "https://i.pinimg.com/1200x/05/ec/a4/05eca4c0292df28cc2b7c4096c284d6e.jpg"
    ]
  },
  {
    "name": "Иван, 31",
    "distance": "38 км от вас",
    "tags": [
      "Плавание",
      "Телец",
      "176 см",
      "63 кг"
    ],
    "description": "ТАРЕЛОЧНИЦЫ МИМО\n\nДевушки ходят по клубам, изменяют, встречаться за деньги мимо.\nИщу девушку ОБЫЧНУЮ за спорт, за доверие, без вредных привычек, готова к семье, не ходит по клубам.\nЯ 176 см, 63 кг, атлет, спортсмен, по клубам не хожу",
    "photos": [
      "https://i.pinimg.com/1200x/78/9b/65/789b65d93a011fbde5f7ce2f24f3eb4a.jpg",
      "https://i.pinimg.com/1200x/3c/48/07/3c48079970359e761b10e797920c06bb.jpg"
    ]
  },
  {
    "name": "Роман, 34",
    "distance": "55 км от вас",
    "tags": [
      "Рак",
      "Держу форму",
      "Не курю"
    ],
    "description": "фото в лс\nДам тебе то, что не сможет ни один холостяк\nЗнаю чего хочу, какую и зачем",
    "photos": [
      "https://i.pinimg.com/1200x/90/d0/cb/90d0cb62554abcbbb3cc1603e3574ca6.jpg"
    ]
  },
  {
    "name": "Леша, 22",
    "distance": "12 км от вас",
    "tags": [
      "Скорпион",
      "182 см",
      "Одинок"
    ],
    "description": "Учусь, работаю, хожу в зальчик. Люблю футбол, теннис, книги, игры, сериалы. На серьезное не зарекаюсь, но всякое бывает)",
    "photos": [
      "https://i.pinimg.com/736x/37/37/6a/37376a5600ec96333ca855d183583ac0.jpg"
    ]
  },
  {
    "name": "Мирон, 31",
    "distance": "28 км от вас",
    "tags": [
      "образован",
      "работаю"
    ],
    "description": "интелектуальное общение",
    "photos": [
      "https://i.pinimg.com/1200x/93/cb/b0/93cbb0777fb307afebd14b0520b5b444.jpg",
      "https://i.pinimg.com/736x/16/c2/04/16c2043208f9c92bccad499d59c56173.jpg"
    ]
  },
  {
    "name": "Даня, 20",
    "distance": "46 км от вас",
    "tags": [
      "Овен",
      "Православие"
    ],
    "description": "Предпочитаю, когда женщина постарше. Способен оплачивать коммунарку и покупать огурцы",
    "photos": [
      "https://i.pinimg.com/736x/12/1b/ba/121bba3b1e8f4d6e70907f268395f3ac.jpg"
    ]
  },
  {
    "name": "Никита, 24",
    "distance": "55 км от вас",
    "tags": [
      "эстет",
      "филантроп",
      "путешественник"
    ],
    "description": "Физическая красота женщины не производит на меня никакого эффекта. Разве только если она сопровождается красотой души, тогда она производит эффект весьма необыкновенный. Она возбуждает во мне желание испытать эту красоту - доступна ли она, или неуязвима. Какой я нахожу ее, такой я ее и оставлю",
    "photos": [
      "https://i.pinimg.com/1200x/b3/e1/d2/b3e1d2aacb27298d642c8b71566176cc.jpg"
    ]
  },
  {
    "name": "Георгий, 37",
    "distance": "21 км от вас",
    "tags": [],
    "description": "ВСЕХ ПОДРЯД НЕ ЛАЙКАЮ\nкак пойдет диалог имеет значение",
    "photos": [
      "https://i.pinimg.com/736x/45/4b/19/454b1918c61307b38908ddf284e47b1b.jpg"
    ]
  },
  {
    "name": "Макар, 25",
    "distance": "67 км от вас",
    "tags": [
      "скорпион",
      "асцендент во льве",
      "доброта",
      "честность",
      "стрессоустойчивость"
    ],
    "description": "УДИВИ",
    "photos": [
      "https://i.pinimg.com/736x/69/cd/b8/69cdb8d02e8e37ac400891f60f76cae8.jpg"
    ]
  }
];

// Делаем данные доступными глобально
if (typeof module !== 'undefined' && module.exports) {
  module.exports = profiles;
}