// profiles.js - общий файл с данными профилей
// Автоматически сгенерировано редактором 23.02.2026, 23:58:11
const profiles = [
  {
    "name": "Николай, 26",
    "distance": "18 км от вас",
    "tags": [
      "MACAN",
      "Jah Khalib",
      "GUF",
      "MiyaGi"
    ],
    "description": "Ищу HR или Стрелец/Весы/Овен\n\nЦеню искренность, чувство юмора, умение наслаждаться простыми вещами",
    "photos": [
      "https://avatars.mds.yandex.net/i?id=54020f314bf0b160580083a7fc3062dd_l-5885384-images-thumbs&n=13"
    ]
  },
  {
    "name": "Гоша Куценка, 69",
    "distance": "1 км от вас",
    "tags": [
      "Сексоголик",
      "Трудяга"
    ],
    "description": "Люблю кино и секс",
    "photos": [
      "https://is1-ssl.mzstatic.com/image/thumb/Features114/v4/e6/68/c4/e668c4b4-1141-1efd-aa7c-84ab5e5dcd32/pr_source.png/1200x675.jpg",
      "https://lisa.ru/images/cache/2021/11/22/fit_414_530_false_crop_1027_577_0_37_q90_1345142_b5317d29d04d3342ffbd42770.png"
    ]
  },
  {
    "name": "Валентина, 30",
    "distance": "1444 км от вас",
    "tags": [
      "ЖИВУНЕТУЖУ",
      "собачий кайф",
      "копенгаген"
    ],
    "description": "Работаю в YANDEX",
    "photos": [
      "https://i.ytimg.com/vi/wWRSFTulm5g/maxresdefault.jpg"
    ]
  },
  {
    "name": " Серёга, 19",
    "distance": "10 км от вас",
    "tags": [
      "Работа",
      "Православие",
      "Лев",
      "190 см",
      "Дружба"
    ],
    "description": "",
    "photos": [
      "https://picsum.photos/500/900?random=100"
    ]
  },
  {
    "name": "Иван, 31",
    "distance": "38 км от вас",
    "tags": [
      "Плавание",
      "Телец",
      "176 см",
      "63 кг"
    ],
    "description": "ТАРЕЛОЧНИЦЫ МИМО\n\nДевушки ходят по клубам, изменяют, встречаться за деньги мимо.\nИщу девушку ОБЫЧНУЮ за спорт, за доверие, без вредных привычек, готова к семье, не ходит по клубам.\nЯ 176 см, 63 кг, атлет, спортсмен, по клубам не хожу",
    "photos": [
      "https://picsum.photos/500/900?random=100"
    ]
  },
  {
    "name": "Роман, 34",
    "distance": "55 км от вас",
    "tags": [
      "Рак",
      "Держу форму",
      "Не курю"
    ],
    "description": "фото в лс\nДам тебе то, что не сможет ни один холостяк\nЗнаю чего хочу, какую и зачем",
    "photos": [
      "https://picsum.photos/500/900?random=100"
    ]
  },
  {
    "name": "Леша, 22",
    "distance": "12 км от вас",
    "tags": [
      "Скорпион",
      "182 см",
      "Одинок"
    ],
    "description": "Учусь, работаю, хожу в зальчик. Люблю футбол, теннис, книги, игры, сериалы. На серьезное не зарекаюсь, но всякое бывает)",
    "photos": [
      "https://picsum.photos/500/900?random=100"
    ]
  },
  {
    "name": "Мирон, 31",
    "distance": "28 км от вас",
    "tags": [
      "образован",
      "работаю"
    ],
    "description": "интелектуальное общение",
    "photos": [
      "https://picsum.photos/500/900?random=100"
    ]
  },
  {
    "name": "Даня, 20",
    "distance": "46 км от вас",
    "tags": [
      "Овен",
      "Православие"
    ],
    "description": "Предпочитаю, когда женщина постарше. Способен оплачивать коммунарку и покупать огурцы",
    "photos": [
      "https://picsum.photos/500/900?random=100"
    ]
  },
  {
    "name": "Никита, 24",
    "distance": "55 км от вас",
    "tags": [
      "эстет",
      "филантроп",
      "путешественник"
    ],
    "description": "Физическая красота женщины не производит на меня никакого эффекта. Разве только если она сопровождается красотой души, тогда она производит эффект весьма необыкновенный. Она возбуждает во мне желание испытать эту красоту - доступна ли она, или неуязвима. Какой я нахожу ее, такой я ее и оставлю",
    "photos": [
      "https://picsum.photos/500/900?random=100"
    ]
  },
  {
    "name": "Георгий, 37",
    "distance": "21 км от вас",
    "tags": [],
    "description": "ВСЕХ ПОДРЯД НЕ ЛАЙКАЮ\nкак пойдет диалог имеет значение",
    "photos": [
      "https://picsum.photos/500/900?random=100"
    ]
  },
  {
    "name": "Макар, 25",
    "distance": "67 км от вас",
    "tags": [
      "скорпион",
      "асцендент во льве",
      "доброта",
      "честность",
      "стрессоустойчивость"
    ],
    "description": "УДИВИ",
    "photos": [
      "https://picsum.photos/500/900?random=100"
    ]
  }
];

// Делаем данные доступными глобально
if (typeof module !== 'undefined' && module.exports) {
  module.exports = profiles;
}